pycom/pycom-micropython-sigfox/esp32/pygate/loragw_hal.c
    /* metadata 3 to 6, timestamp trigger value */
    /* TX state machine must be triggered at T0 - TX_START_DELAY for packet to start being emitted at T0 */
    if (pkt_data->tx_mode == TIMESTAMPED) {
        count_trig = pkt_data->count_us - TX_START_DELAY - SX1308.offtmstp; /* Corrected with PicoCell offset */
        buff[3] = 0xFF & (count_trig >> 24);
        buff[4] = 0xFF & (count_trig >> 16);
        buff[5] = 0xFF & (count_trig >> 8);
        buff[6] = 0xFF & count_trig;
    }

    /* parameters depending on modulation  */
    if (pkt_data->modulation == MOD_LORA) {
        /* metadata 7, modulation type, radio chain selection and TX power */
        buff[7] = (0x20 & (pkt_data->rf_chain << 5)) | (0x0F & pow_index); /* bit 4 is 0 -> LoRa modulation */

        buff[8] = 0; /* metadata 8, not used */

        /* metadata 9, CRC, LoRa CR & SF */
        switch (pkt_data->datarate) {
            case DR_LORA_SF7:
                buff[9] = 7;
                break;
            case DR_LORA_SF8:
                buff[9] = 8;
                break;
            case DR_LORA_SF9:
                buff[9] = 9;
                break;
            case DR_LORA_SF10:
                buff[9] = 10;
                break;
            case DR_LORA_SF11:
                buff[9] = 11;
                break;
            case DR_LORA_SF12:
                buff[9] = 12;
                break;
            default:
                DEBUG_PRINTF("ERROR: UNEXPECTED VALUE %d IN SWITCH STATEMENT\n", pkt_data->datarate);
        }
        switch (pkt_data->coderate) {
            case CR_LORA_4_5:
                buff[9] |= 1 << 4;
                break;
            case CR_LORA_4_6:
                buff[9] |= 2 << 4;
                break;
            case CR_LORA_4_7:
                buff[9] |= 3 << 4;
                break;
            case CR_LORA_4_8:
                buff[9] |= 4 << 4;
                break;
            default:
                DEBUG_PRINTF("ERROR: UNEXPECTED VALUE %d IN SWITCH STATEMENT\n", pkt_data->coderate);
        }
        if (pkt_data->no_crc == false) {
            buff[9] |= 0x80; /* set 'CRC enable' bit */
        } else {
            DEBUG_MSG("Info: packet will be sent without CRC\n");
        }

        /* metadata 10, payload size */
        buff[10] = pkt_data->size;

        /* metadata 11, implicit header, modulation bandwidth, PPM offset & polarity */
        switch (pkt_data->bandwidth) {
            case BW_125KHZ:
                buff[11] = 0;
                break;
            case BW_250KHZ:
                buff[11] = 1;
                break;
            case BW_500KHZ:
                buff[11] = 2;
                break;
            default:
                DEBUG_PRINTF("ERROR: UNEXPECTED VALUE %d IN SWITCH STATEMENT\n", pkt_data->bandwidth);
        }
        if (pkt_data->no_header == true) {
            buff[11] |= 0x04; /* set 'implicit header' bit */
        }
        if (SET_PPM_ON(pkt_data->bandwidth, pkt_data->datarate)) {
            buff[11] |= 0x08; /* set 'PPM offset' bit at 1 */
        }
        if (pkt_data->invert_pol == true) {
            buff[11] |= 0x10; /* set 'TX polarity' bit at 1 */
        }

        /* metadata 12 & 13, LoRa preamble size */
        if (pkt_data->preamble == 0) { /* if not explicit, use recommended LoRa preamble size */
            pkt_data->preamble = STD_LORA_PREAMBLE;
        } else if (pkt_data->preamble < MIN_LORA_PREAMBLE) { /* enforce minimum preamble size */
            pkt_data->preamble = MIN_LORA_PREAMBLE;
            DEBUG_MSG("Note: preamble length adjusted to respect minimum LoRa preamble size\n");
        }
        buff[12] = 0xFF & (pkt_data->preamble >> 8);
        buff[13] = 0xFF & pkt_data->preamble;

        /* metadata 14 & 15, not used */
        buff[14] = 0;
        buff[15] = 0;

        /* MSB of RF frequency is now used in AGC firmware to implement large/narrow filtering in SX1257/55 */
        buff[0] &= 0x3F; /* Unset 2 MSBs of frequency code */
        if (pkt_data->bandwidth == BW_500KHZ) {
            buff[0] |= 0x80; /* Set MSB bit to enlarge analog filter for 500kHz BW */
        } else if (pkt_data->bandwidth == BW_125KHZ) {
            buff[0] |= 0x40; /* Set MSB-1 bit to enable digital filter for 125kHz BW */
        }

    } else if (pkt_data->modulation == MOD_FSK) {
        /* metadata 7, modulation type, radio chain selection and TX power */
        buff[7] = (0x20 & (pkt_data->rf_chain << 5)) | 0x10 | (0x0F & pow_index); /* bit 4 is 1 -> FSK modulation */

        buff[8] = 0; /* metadata 8, not used */

        /* metadata 9, frequency deviation */
        buff[9] = pkt_data->f_dev;

        /* metadata 10, payload size */
        buff[10] = pkt_data->size;
        /* TODO: how to handle 255 bytes packets ?!? */

        /* metadata 11, packet mode, CRC, encoding */
        buff[11] = 0x01 | (pkt_data->no_crc ? 0 : 0x02) | (0x02 << 2); /* always in variable length packet mode, whitening, and CCITT CRC if CRC is not disabled  */

        /* metadata 12 & 13, FSK preamble size */
        if (pkt_data->preamble == 0) { /* if not explicit, use LoRa MAC preamble size */
            pkt_data->preamble = STD_FSK_PREAMBLE;
        } else if (pkt_data->preamble < MIN_FSK_PREAMBLE) { /* enforce minimum preamble size */
            pkt_data->preamble = MIN_FSK_PREAMBLE;
            DEBUG_MSG("Note: preamble length adjusted to respect minimum FSK preamble size\n");
        }
        buff[12] = 0xFF & (pkt_data->preamble >> 8);
        buff[13] = 0xFF & pkt_data->preamble;

        /* metadata 14 & 15, FSK baudrate */
        fsk_dr_div = (uint16_t)((uint32_t)LGW_XTAL_FREQU / pkt_data->datarate); /* Ok for datarate between 500bps and 250kbps */
        buff[14] = 0xFF & (fsk_dr_div >> 8);
        buff[15] = 0xFF & fsk_dr_div;

        /* insert payload size in the packet for variable mode */
        buff[16] = pkt_data->size;
        ++transfer_size; /* one more byte to transfer to the TX modem */
        ++payload_offset; /* start the payload with one more byte of offset */

        /* MSB of RF frequency is now used in AGC firmware to implement large/narrow filtering in SX1257/55 */
        buff[0] &= 0x7F; /* Always use narrow band for FSK (force MSB to 0) */

    } else {
        DEBUG_MSG("ERROR: INVALID TX MODULATION..\n");
        return LGW_HAL_ERROR;
    }

    /* copy payload from user struct to buffer containing metadata */
    memcpy((void *)(buff + payload_offset), (void *)(pkt_data->payload), pkt_data->size);

    /* reset TX command flags */
    lgw_abort_tx();

